# Rebar Crank Overridable Parameters Get Crank End Offset Length Formula Params Method

Source: https://www.revitapidocs.com/2026/7e4e8e6c-d6a4-d562-65e2-809f296951af.htm

---

| Rebar Crank Overridable Parameters Get Crank End Offset Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankEndOffsetLengthFormulaParams()
```

```
Public Function GetCrankEndOffsetLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankEndOffsetLengthFormulaParams()
```

```
member GetCrankEndOffsetLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Retruns the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace